# ~/.config/homebrew/Brewfile -- managed by chezmoi
# Source: private_dot_config/homebrew/Brewfile.tmpl  (edit the .tmpl, not the target)
#
# Installed automatically by .chezmoiscripts/run_onchange_after_10-brew-bundle.sh.tmpl
# on tag-bearing hosts. Run it by hand anytime with:
#     brew bundle --file=~/.config/homebrew/Brewfile
#
# Layout:
#   - Cross-platform: installed via brew on macOS AND tag-bearing Linux. Holds the
#     modern CLI tools I want identical on every host, where apt's builds lag too
#     far behind (Ubuntu 22 especially) or aren't packaged at all.
#   - macOS only: GUI casks, fonts, and CLI tools that on Linux come from
#     apt / official install scripts / local builds instead.

{{- $tags := list }}
{{- if hasKey . "tags" }}{{ $tags = .tags }}{{ end }}
# ---- Cross-platform (brew on macOS AND tag-bearing Linux) ----
# Modern CLI tools I want identical on every host. apt's builds lag too far
# behind (Ubuntu 22 especially) or aren't packaged, so brew owns them everywhere.
brew "neovim"
brew "tmux"        # heavy tmux config ships here; keep it explicit, not a transitive dep
brew "direnv"      # universal: binary + fish hook ship on every host
brew "fd"
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "yazi"
brew "zoxide"
brew "gdu"
brew "uv"
brew "btop"
brew "fastfetch"
brew "jq"
brew "tree"
brew "treemd"

{{ if eq .chezmoi.os "darwin" -}}
# ---- macOS: core (every tagged Mac, including the lightweight one) ----
# On Linux these come from apt / official install scripts / local builds, not brew.

# Modern bash (macOS ships 3.2; some scripts assume 5.x)
brew "bash"

# CLI tools
brew "chezmoi"
brew "fish"
brew "fnm"
brew "poppler"
brew "resvg"
brew "sevenzip"
# ffmpeg: full build on dev boxes, lightweight build on non-dev (yazi previews)
{{ if has "dev" $tags }}brew "ffmpeg-full"{{ else }}brew "ffmpeg"{{ end }}

# GUI apps & terminals
cask "ghostty"
cask "keepassxc"
cask "input-source-pro"

# AI coding tools
cask "claude-code"
cask "codex"
tap "manaflow-ai/cmux"
cask "cmux"                    # Ghostty-based terminal for AI coding agents

# Utilities
cask "pearcleaner"             # app uninstaller / leftover-file cleaner
# snapzy: screenshot tool. Its tap is non-official, so on a fresh machine run
# this once before `brew bundle` (brew bundle cannot trust a tap for you):
#   brew trust --cask duongductrong/snapzy/snapzy
tap "duongductrong/snapzy"
cask "snapzy"

# Fonts (terminal / icon rendering)
cask "font-maple-mono-nf-cn"
cask "font-symbols-only-nerd-font"

{{ if has "dev" $tags -}}
# ---- macOS: dev-only (skipped on the lightweight, proxy-only Mac) ----
# Heavy media / LaTeX / Lua toolchain a pure-entertainment Mac doesn't need.
brew "imagemagick-full"
brew "luarocks"
brew "tmuxinator"
cask "skim"                    # PDF viewer (pairs with basictex)
cask "basictex"                # LaTeX distribution
cask "font-libertinus"         # scientific-plotting body font
{{ end -}}
{{ end -}}

{{ if eq .chezmoi.os "linux" -}}
# ---- Linux only ----
# Add sparingly: most Linux packages come from apt, official install scripts, or
# local builds, not Homebrew.

# tmuxinator's config ships to Linux hosts too, but apt's ruby packaging is
# awkward, so brew is the cleaner install path. (macOS lists it above.)
brew "tmuxinator"
{{ end -}}
